
&НаКлиенте
Процедура инт_ПоказатьТелефоныКАПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаТелефоныКонтрагента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура инт_ПоказатьБанковскиеКартыКАПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаБанковскиеКартыКонтрагента", ПараметрыФормы);
	
КонецПроцедуры


