
&НаСервере
Процедура инт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Продукт = Объект.Продукт; 
	ЭтаФорма.СтатьяРасходовУУ = Объект.СтатьяРасходовУУ;
КонецПроцедуры

&НаСервере
Процедура инт_ПродуктПриИзмененииВместоНаСервере(ФормаПродукт)
	Объект.Продукт = ФормаПродукт;
КонецПроцедуры

&НаКлиенте
Процедура инт_ПродуктПриИзмененииВместо(Элемент)
	инт_ПродуктПриИзмененииВместоНаСервере(ЭтаФорма.Продукт);
КонецПроцедуры

&НаСервере
Процедура инт_СтатьяРасходовУУПриИзмененииВместоНаСервере(ФормаСатьяРасходовУУ)
		Объект.СтатьяРасходовУУ= ФормаСатьяРасходовУУ;
КонецПроцедуры

&НаКлиенте
Процедура инт_СтатьяРасходовУУПриИзмененииВместо(Элемент)
	инт_СтатьяРасходовУУПриИзмененииВместоНаСервере(ЭтаФорма.СтатьяРасходовУУ);
КонецПроцедуры
