&НаСервере
Функция ПолучитьСчетНаОплату(Организация, Документ, ДатаДокумента, НомерДокумента) экспорт
	
	МассивОбъектов = Новый Массив;
	
	//Если ссылка на счет передана явно, то нет смысла его искать
	Если Документ <> Неопределено Тогда
		МассивОбъектов.Добавить(Документ);
	Иначе
		
	Документ = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Номер = &Номер
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода и &ОкончаниеПериода
		|	И СчетНаОплатуПокупателю.Организация = &Организация";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ДатаДокумента));
	Запрос.УстановитьПараметр("Номер", НомерДокумента);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОбъектов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
		
	КонецЕсли;	

	Возврат МассивОбъектов;
	
КонецФункции	

&НаСервере
Функция ПолучитьРеализациюТоваровИУслуг(Организация, Документ, ДатаДокумента, НомерДокумента) экспорт
	
	МассивОбъектов = Новый Массив;
	
	//Если ссылка на счет передана явно, то нет смысла его искать
	Если Документ <> Неопределено Тогда
		МассивОбъектов.Добавить(Документ);
	Иначе
		
	СчетНаОплатуПокупателю = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Номер = &Номер
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода и &ОкончаниеПериода
		|	И РеализацияТоваровУслуг.Организация = &Организация";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ДатаДокумента));
	Запрос.УстановитьПараметр("Номер", НомерДокумента);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОбъектов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
		
	КонецЕсли;	

	Возврат МассивОбъектов;
	
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументСчетаНаОплату(Организация, Документ, ДатаДокумента, НомерДокумента, ПечатнаяФорма) экспорт
	
   	МассивОбъектов = ПолучитьСчетНаОплату(Организация, Документ, ДатаДокумента, НомерДокумента);
	ТипыОбъектов = ОбщегоНазначенияБП.РазложитьСписокПоТипамОбъектов(МассивОбъектов);
	
	Для каждого ОбъектыТипа Из ТипыОбъектов Цикл
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбъектыТипа.Значение[0]);
		
		ДокументыБезСчетовНаОплату = Неопределено;
		СоответствиеСчетовРеализациям = Неопределено;
		ТаблицаСведенийСчетНаОплату = МенеджерОбъекта.ПолучитьТаблицуСведенийСчетаНаОплату(ОбъектыТипа.Значение, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
		
		ОбъектыПечати 	= Новый СписокЗначений;
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
		
		ТабДок = ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату, ОбъектыПечати, ПараметрыПечати);	
			
	КонецЦикла;
	
	
	Возврат ТабДок;

КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументТОРГ12(Организация, Документ, ДатаДокумента, НомерДокумента, ПечатнаяФорма) экспорт
	
   	МассивОбъектов = ПолучитьРеализациюТоваровИУслуг(Организация, Документ, ДатаДокумента, НомерДокумента);
	ТипыОбъектов = ОбщегоНазначенияБП.РазложитьСписокПоТипамОбъектов(МассивОбъектов);
	
	Для каждого ОбъектыТипа Из ТипыОбъектов Цикл
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбъектыТипа.Значение[0]);
		
		
		
		ОбъектыПечати 	= Новый СписокЗначений;
		ПараметрыПечати = Новый Структура;
		
		Если НРЕГ(СокрЛП(ПечатнаяФорма)) = "torg12" тогда
			
			ТаблицаСведенийТОРГ12 = МенеджерОбъекта.ПолучитьТаблицуСведенийТОРГ12(ОбъектыТипа.Значение, Ложь);
			ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12");			
			
		ИначеЕсли НРЕГ(СокрЛП(ПечатнаяФорма)) = "torg12usl" тогда
			
			ТаблицаСведенийТОРГ12 = МенеджерОбъекта.ПолучитьТаблицуСведенийТОРГ12(ОбъектыТипа.Значение, Истина);
			ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12");

		КонецЕсли;		
		
		ТабДок = ПечатьТорговыхДокументов.ПечатьТОРГ12(ТаблицаСведенийТОРГ12, ОбъектыПечати, ПараметрыПечати);	
			
	КонецЦикла;
	
	
	Возврат ТабДок;

	
КонецФункции