
&НаКлиенте
Процедура КомандаОК(Команда)
	МассивНомеров = Новый Массив; 
	Для каждого СтрокаТЧ из БанковскиеКартыКонтрагентов цикл
		МассивНомеров.Добавить(СтрокаТЧ.НомерКарты);
	КонецЦикла;	
	ЗаписатьНаСервере(Владелец, МассивНомеров);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
		Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Контрагент") Тогда 
		Владелец = Параметры.Контрагент.Ссылка;
		ЭтаФорма.Владелец = Владелец; 
		БанковскиеКартыКонтрагентов.Очистить();
		Для каждого СтрокаТЧИсточник из Владелец.БанковскиеКартыКонтрагентов цикл
			СтрокаТЧПриемник = БанковскиеКартыКонтрагентов.Добавить();
			СтрокаТЧПриемник.НомерКарты = СтрокаТЧИсточник.НомерКарты;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьНаСервере(Владелец, МассивНомеров)
	Приемник = Владелец.ПолучитьОбъект();
	ТЧПриемник = Приемник.БанковскиеКартыКонтрагентов;
	ТЧПриемник.Очистить(); 
	стр = "";
	Для каждого ЭлементМассива из МассивНомеров цикл 
		СтрокаТЧПриемник = ТЧПриемник.Добавить();
		СтрокаТЧПриемник.НомерКарты = ЭлементМассива;
		стр = стр + ЭлементМассива + ";"; 
	КонецЦикла; 
	Приемник.БанковскиеКартыСтрокой = стр;
	Приемник.Записать();
КонецПроцедуры	

