
&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда 
		Владелец = Параметры.Контрагент.Ссылка;
		ЭтаФорма.Владелец = Владелец; 
		ТелефонныеНомераКонтрагентов.Очистить();
		Для каждого СтрокаТЧИсточник из Владелец.ТелефонныеНомераКонтрагентов цикл
			СтрокаТЧПриемник = ТелефонныеНомераКонтрагентов.Добавить();
			СтрокаТЧПриемник.НомерТелефона = СтрокаТЧИсточник.НомерТелефона;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьНаСервере(Владелец, МассивНомеров)
	Приемник = Владелец.ПолучитьОбъект();
	ТЧПриемник = Приемник.ТелефонныеНомераКонтрагентов;
	ТЧПриемник.Очистить();
	стр = "";
	Для каждого ЭлементМассива из МассивНомеров цикл 
		СтрокаТЧПриемник = ТЧПриемник.Добавить();
		СтрокаТЧПриемник.НомерТелефона = ЭлементМассива;
		стр = стр + ЭлементМассива + ";"; 
	КонецЦикла;
	Приемник.ТелефонныеНомераСтрокой = стр;
	Приемник.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОК(Команда)
	МассивНомеров = Новый Массив; 
	Для каждого СтрокаТЧ из ТелефонныеНомераКонтрагентов цикл
		МассивНомеров.Добавить(СтрокаТЧ.НомерТелефона);
	КонецЦикла;	
	ЗаписатьНаСервере(Владелец, МассивНомеров);
	Закрыть();
КонецПроцедуры